Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/goormdotcom/prod/runs/run-uigBAyTEVee4cWqG

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.ecr_product.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/product-service]
module.ecr_order.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_payment.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_product.aws_iam_policy.push: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-push]
module.rds_user.aws_db_parameter_group.this: Refreshing state... [id=user-pg-16]
module.rds_order.aws_db_parameter_group.this: Refreshing state... [id=order-pg-16]
module.rds_product.aws_db_parameter_group.this: Refreshing state... [id=product-pg-16]
module.ecr_product.aws_iam_policy.pull: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-pull]
module.rds_payment.aws_db_parameter_group.this: Refreshing state... [id=payment-pg-16]
module.common_network.aws_vpc.goorm: Refreshing state... [id=vpc-05849d37708e8d04b]
module.ecr_user.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_product.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/product-service]
module.ecr_order.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_payment.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_user.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_policy_user.data.aws_iam_policy_document.push: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.push: Refresh complete after 0s [id=1624808761]
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refresh complete after 0s [id=3726282990]
module.common_network.aws_subnet.private-db: Refreshing state... [id=subnet-05a8605bf45055418]
module.common_network.aws_subnet.public: Refreshing state... [id=subnet-09ad4d9343cfb64c7]
module.common_network.aws_subnet.private-db-2: Refreshing state... [id=subnet-0510549f3411c9d6b]
module.common_network.aws_subnet.private-app: Refreshing state... [id=subnet-039f40894ea2007f2]
module.security.aws_security_group.rds_order: Refreshing state... [id=sg-01500a61cef193bc6]
module.security.aws_security_group.rds_product: Refreshing state... [id=sg-0f9265b7ebd7016e2]
module.security.aws_security_group.rds_user: Refreshing state... [id=sg-0c32e1ec713957804]
module.security.aws_security_group.rds_payment: Refreshing state... [id=sg-0613fe7cffbbed089]
module.rds_payment.aws_db_subnet_group.this: Refreshing state... [id=payment-db-subnet-group]
module.rds_product.aws_db_subnet_group.this: Refreshing state... [id=product-db-subnet-group]
module.rds_order.aws_db_subnet_group.this: Refreshing state... [id=order-db-subnet-group]
module.rds_user.aws_db_subnet_group.this: Refreshing state... [id=user-db-subnet-group]
module.rds_payment.aws_db_instance.this: Refreshing state... [id=payment]
module.rds_product.aws_db_instance.this: Refreshing state... [id=product]
module.rds_order.aws_db_instance.this: Refreshing state... [id=order]
module.rds_user.aws_db_instance.this: Refreshing state... [id=user]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ecr_policy_user.aws_iam_policy.pull will be created
  + resource "aws_iam_policy" "pull" {
      + arn         = (known after apply)
      + description = "Allow pulling images from selected ECR repositories"
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetAuthorizationToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:ListImages",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/user-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/product-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/payment-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/order-service",
                        ]
                      + Sid      = "PullFromRepositories"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_policy_user.aws_iam_policy.push will be created
  + resource "aws_iam_policy" "push" {
      + arn         = (known after apply)
      + description = "Allow pushing images to selected ECR repositories"
      + id          = (known after apply)
      + name        = "ecr-push"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetAuthorizationToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/user-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/product-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/payment-service",
                          + "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/order-service",
                        ]
                      + Sid      = "PushToRepositories"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_product.aws_iam_policy.pull will be destroyed
  - resource "aws_iam_policy" "pull" {
      - arn         = "arn:aws:iam::277679348474:policy/ecr-pull" -> null
      - description = "Allow pulling images" -> null
      - id          = "arn:aws:iam::277679348474:policy/ecr-pull" -> null
      - name        = "ecr-pull" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:ListImages",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/product-service"
                      - Sid      = "PullFromRepository"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUBJX2TL5L2UWAYX6S" -> null
      - tags        = {
          - "ManagedBy" = "Terraform"
        } -> null
      - tags_all    = {
          - "ManagedBy" = "Terraform"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecr_product.aws_iam_policy.push will be destroyed
  - resource "aws_iam_policy" "push" {
      - arn         = "arn:aws:iam::277679348474:policy/ecr-push" -> null
      - description = "Allow pushing images" -> null
      - id          = "arn:aws:iam::277679348474:policy/ecr-push" -> null
      - name        = "ecr-push" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:ListImages",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-2:277679348474:repository/goormdotcom/product-service"
                      - Sid      = "PushToRepository"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUBJX2TL5N43WYWWR2" -> null
      - tags        = {
          - "ManagedBy" = "Terraform"
        } -> null
      - tags_all    = {
          - "ManagedBy" = "Terraform"
        } -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 4 of 8 estimated
           $301.8399999999998976/mo +$0.0

<!-- Sticky Pull Request Commentterraform-plan -->